---
type: MultiSegmentGrid
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# MultiSegmentGrid

`Autodesk.Revit.DB.MultiSegmentGrid` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AreGridsInSameMultiSegmentGrid | 2013 | `public static bool AreGridsInSameMultiSegmentGrid ( Grid grid1 , Grid grid2 )` |
| Method | Create | 2013 | `public static ElementId Create ( Document document , ElementId typeId , CurveLoop curveLoop , ElementId sketchPlaneId )` |
| Method | GetGridIds | 2013 | `public ICollection < ElementId > GetGridIds ()` |
| Method | GetMultiSegementGridId | 2013 | `public static ElementId GetMultiSegementGridId ( Grid grid )` |
| Method | IsValidCurveLoop | 2013 | `public static bool IsValidCurveLoop ( CurveLoop curveLoop )` |
| Method | IsValidSketchPlaneId | 2013 | `public static bool IsValidSketchPlaneId ( Document document , ElementId elemId )` |
| Property | Parameter | — | `` |
| Property | Text | 2013 | `public string Text { get ; set ; }` |